; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v1)
             (pred_12 ?v9 ?v8)
             (pred_1 ?v4 ?v8)
             (pred_9 ?v5 ?v4 )
	     (pred_3 ?v4)
             (pred_11 ?v13)
             (pred_7 ?v9)
             (pred_5 ?v8)
             (pred_4 ?v4)
             (pred_8 ?v9)
             (pred_6 ?v4)
             (pred_2 ))



(:action op_2
:parameters (?v10 ?v12 ?v11 ?v2)
:precondition (and (pred_11 ?v10) (pred_11 ?v12) (pred_7 ?v11) (pred_5 ?v2)
          (pred_10 ?v10 ?v12) (pred_12 ?v11 ?v2)
                   (pred_1 ?v12 ?v2) (pred_3 ?v10) 
                   (pred_4 ?v12) (pred_8 ?v11))
:effect (and  (pred_6 ?v12) (not (pred_4 ?v12))))


(:action op_3
:parameters (?v10 ?v3)
:precondition (and (pred_11 ?v10) (pred_11 ?v3)
               (pred_3 ?v10) (pred_10 ?v10 ?v3) (pred_6 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v10))))

(:action op_4
:parameters (?v10 ?v11)
:precondition (and (pred_11 ?v10) (pred_7 ?v11) 
                  (pred_3 ?v10) (pred_9 ?v11 ?v10) (pred_2 ))
:effect (and (pred_8 ?v11)
   (not (pred_9 ?v11 ?v10)) (not (pred_2 ))))


(:action op_5
:parameters (?v10 ?v7 ?v6)
:precondition (and (pred_11 ?v10) (pred_7 ?v7) (pred_7 ?v6)
                  (pred_3 ?v10) (pred_8 ?v6) (pred_9 ?v7 ?v10))
:effect (and (pred_8 ?v7) (pred_9 ?v6 ?v10)
        (not (pred_8 ?v6)) (not (pred_9 ?v7 ?v10))))

(:action op_1
:parameters (?v10 ?v11)
:precondition (and (pred_11 ?v10) (pred_7 ?v11) 
                  (pred_3 ?v10) (pred_8 ?v11))
:effect (and (pred_2 ) (pred_9 ?v11 ?v10) (not (pred_8 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_24 obj_23 obj_15 obj_02 obj_05 obj_25 obj_11 obj_12 obj_13 obj_10 obj_18 obj_30 obj_14 obj_29 obj_27 obj_01 obj_19 obj_17 obj_22 obj_21 obj_26 obj_28 obj_20 obj_06
    obj_08 obj_04 obj_09
    obj_31 obj_16 obj_03
    )

    (:init
       (pred_2)

       (pred_11 obj_07)
       (pred_11 obj_24)
       (pred_11 obj_23)
       (pred_11 obj_15)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_25)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_18)
       (pred_11 obj_30)
       (pred_11 obj_14)
       (pred_11 obj_29)
       (pred_11 obj_27)
       (pred_11 obj_01)
       (pred_11 obj_19)
       (pred_11 obj_17)
       (pred_11 obj_22)
       (pred_11 obj_21)
       (pred_11 obj_26)
       (pred_11 obj_28)
       (pred_11 obj_20)
       (pred_11 obj_06)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_09)
       (pred_7 obj_31)
       (pred_7 obj_16)
       (pred_7 obj_03)

       (pred_10 obj_07 obj_05)
       (pred_10 obj_07 obj_24)
       (pred_10 obj_24 obj_25)
       (pred_10 obj_24 obj_23)
       (pred_10 obj_24 obj_07)
       (pred_10 obj_23 obj_11)
       (pred_10 obj_23 obj_15)
       (pred_10 obj_23 obj_24)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_15 obj_23)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_05 obj_25)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_25 obj_18)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_25 obj_24)
       (pred_10 obj_25 obj_05)
       (pred_10 obj_11 obj_30)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_23)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_12 obj_14)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_13 obj_29)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_10 obj_27)
       (pred_10 obj_10 obj_18)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_18 obj_30)
       (pred_10 obj_18 obj_25)
       (pred_10 obj_18 obj_10)
       (pred_10 obj_30 obj_19)
       (pred_10 obj_30 obj_14)
       (pred_10 obj_30 obj_11)
       (pred_10 obj_30 obj_18)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_29)
       (pred_10 obj_14 obj_12)
       (pred_10 obj_14 obj_30)
       (pred_10 obj_29 obj_22)
       (pred_10 obj_29 obj_13)
       (pred_10 obj_29 obj_14)
       (pred_10 obj_27 obj_21)
       (pred_10 obj_27 obj_01)
       (pred_10 obj_27 obj_10)
       (pred_10 obj_01 obj_26)
       (pred_10 obj_01 obj_19)
       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_27)
       (pred_10 obj_19 obj_28)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_19 obj_30)
       (pred_10 obj_19 obj_01)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_22)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_19)
       (pred_10 obj_22 obj_06)
       (pred_10 obj_22 obj_29)
       (pred_10 obj_22 obj_17)
       (pred_10 obj_21 obj_26)
       (pred_10 obj_21 obj_27)
       (pred_10 obj_26 obj_28)
       (pred_10 obj_26 obj_01)
       (pred_10 obj_26 obj_21)
       (pred_10 obj_28 obj_20)
       (pred_10 obj_28 obj_19)
       (pred_10 obj_28 obj_26)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_28)
       (pred_10 obj_06 obj_22)
       (pred_10 obj_06 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_1  obj_17 obj_08)
       (pred_1  obj_15 obj_04)
       (pred_1  obj_02 obj_09)
       (pred_6 obj_07)
       (pred_6 obj_24)
       (pred_6 obj_23)
       (pred_6 obj_05)
       (pred_6 obj_25)
       (pred_6 obj_11)
       (pred_6 obj_12)
       (pred_6 obj_13)
       (pred_6 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_30)
       (pred_6 obj_14)
       (pred_6 obj_29)
       (pred_6 obj_27)
       (pred_6 obj_01)
       (pred_6 obj_19)
       (pred_6 obj_22)
       (pred_6 obj_21)
       (pred_6 obj_26)
       (pred_6 obj_28)
       (pred_6 obj_20)
       (pred_6 obj_06)

       (pred_12  obj_31 obj_08)
       (pred_12  obj_16 obj_04)
       (pred_12  obj_03 obj_09)
       (pred_9 obj_31 obj_07)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_03 obj_07)
       (pred_3 obj_10)
    )

    (:goal (and
       (pred_9 obj_03 obj_24)
    ))
(:constraints
  (always (not (pred_3 obj_05)))
)
)

; plan
1. (op_3 obj_10 obj_18)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_18)
   goals met: 0 of 1
2. (op_3 obj_18 obj_25)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_25)
   goals met: 0 of 1
3. (op_3 obj_25 obj_24)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_24)
   goals met: 0 of 1
4. (op_3 obj_24 obj_07)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_07)
   goals met: 0 of 1
5. (op_4 obj_07 obj_03)
   deleted: (pred_9 obj_03 obj_07) (pred_2)
   added: (pred_8 obj_03)
   goals met: 0 of 1
6. (op_3 obj_07 obj_24)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_24)
   goals met: 0 of 1
7. (op_1 obj_24 obj_03)
   deleted: (pred_8 obj_03)
   added: (pred_2) (pred_9 obj_03 obj_24)
   goals met: 1 of 1
